// ajax 관련 코드 (by.세일) 건들지 말 것 

$(document).ready(function () {

  listing();
  catListing();
});

function listing() {
  $.ajax({
    type: "GET",
    url: "/orders",
    data: {},
    success: function (response) {
      if (response['result'] == 'success') {
        let orders = response['recipe3'];
        let orders2 = response['recipe'];

        console.log(response);


      } else {
        alert('기사를 받아오지 못했습니다');
      }
    }
  })


}


function catListing(Val) {

  let temp_html = ''
  let gus = []

  if (Val == '알류') {
    gus = ["전란"]
  } else if (Val == '유제품') {
    gus = ["요거트", "연유", "요구르트", "우유", "체다치즈", "크림치즈",
          "탈지분유", "파마산치즈", "파마산치즈가루"]
  
  } else if (Val == '유지류') {
    gus = ["코코넛오일", "콩기름", "튀김기름"]
  
  } else if (Val == '견과류') {
    gus = ["아몬드", "아몬드가루", "잣", "캐슈넛", "피칸", "호두"]
  
  } else if (Val == '과일류') {
    gus = ["아보카도", "오렌지", "체리", "크랜베리", "키위", "통조림파인애플",
            "파인애플"]
  
  } else if (Val == '육류') {
    gus = ["양지", "차돌박이", "채끝살", "치킨", "치킨너겟", "치킨텐더",
          "프랑크소시지", "항정살", "햄", "훈제닭가슴살", "훈제오리"]
  
  } else if (Val == '콩류') {
    gus = ["연두부", "완두콩", "콩가루", "팥"]
  
  } else if (Val == '곡류') {
    gus = ["쌀", "쌀가루", "오트밀", "옥수수", "옥수수가루", "옥수수통조림",
          "찹쌀", "찹쌀가루", "캔옥수수", "통밀가루"]
  
  } else if (Val == '해조류') {
    gus = ["조미김", "톳", "파래"]
  
  } else if (Val == '어패류') {
    gus = ["연어", "연어캔", "잔멸치", "장어", "조기", "중멸치", "지리멸치",
            "참치통조림", "코다리", "홍합", "황태", "황태채", "황태포", "훈제연어",
          ]
  
  } else if (Val == '갑각류') {
    gus = ["자숙새우", "칵테일새우", "크래미", "흰다리새우"]
  
  } else if (Val == '버섯류') {
    gus = ["애느타리버섯", "양송이버섯", "팽이버섯", "표고버섯", "표고버섯가루"]
  
  } else if (Val == '채소류') {
    gus = ["쌈무", "쌈채소", "쑥갓", "아스파라거스", "아욱", "알배기배추", 
          "애호박", "양배추", "양상추", "양파", "얼갈이배추", "연근",
          "열무", "열무김치", "오이", "오이고추", "오이피클", "우거지",
          "우엉", "적양배추", "적채", "조선호박", "쥐똥고추", "쥬키니호박",
          "쪽파", "참나물", "채소", "청경채", "청양고추", "취나물", "치커리",
          "케일", "콩나물", "토마토", "파", "파프리카", "피망", "호박"]
  
  } else if (Val == '소스류') { // + 향신료
    gus = ["씨겨자", "아가베시럽", "연겨자", "오레가노", "우스터소스", "원당",
            "월계수잎", "유기농설탕", "초코시럽", "춘장", "칠리소스", "카레",
            "타임", "토마토소스", "토마토케첩", "통후추", "파슬리", "파슬리가루",
            "페퍼론치노", "풋고추", "피시소스", "허니머스터드", "홀그레인머스터드",
            ]
  
  } else if (Val == '기타') {
    gus = ["쌀국수", "쌀떡볶이떡", "쌀뜨물", "쑥가루", "아이스크림", "어묵",
  "오레오", "오미자청", "올리브", "우동", "유부", "유자청", "이스트",
  "인삼", "전분", "정종", "젤라틴","오징어", "오징어채","주꾸미", "쥐포",
  "진미오징어채", "쫄면", "초코칩", "초코펜", "초콜릿", "칼국수", "커피가루",
  "코코넛가루", "코코아가루", "콜라", "크래커", "토마토퓨레", "통깨", "튀김가루",
  "푸실리", "한천가루", "핫케이크가루", "해물믹스", "해바라기씨", "호떡믹스", "호박씨",
  "호박잎", "화이트와인", "화이트초콜릿", "후리가케", "흑임자"]

    for (let i = 0; i < gus.length; i++) {
      temp_html += '<option value=' + gus[i] + '>' + gus[i] + '</option>'
    }


    $('#inputState_select2').empty()
    $('#inputState_select2').append(temp_html)

  }