// ajax 관련 코드 (by.세일) 건들지 말 것 

$(document).ready(function () {

  listing();
  catListing();
});

function listing() {
  $.ajax({
    type: "GET",
    url: "/orders",
    data: {},
    success: function (response) {
      if (response['result'] == 'success') {
        let orders = response['recipe3'];
        let orders2 = response['recipe'];

        console.log(response);


      } else {
        alert('기사를 받아오지 못했습니다');
      }
    }
  })


}


function catListing(Val) {

  let temp_html = ''
  let gus = []

  if (Val == '알류') {
    gus = ["계란", "달걀", "메추리알", "날치알", "거위알"]

  } else if (Val == '유제품') {
    gus = ["우유", "연유", "버터", "치즈","모짜렐라치즈","바나나우유","바나나아이스크림","분유","스트링치즈"]
  } else if (Val == '유지류') {
    gus = []
  } else if (Val == '견과류') {
    gus = []
  } else if (Val == '과일류') {
    gus = ["과일","건크랜베리","크랜베리","건포도","포도","귤","딸기","냉동딸기","딸기잼","냉동블루베리","블루베리","레몬",
    "레몬제스트","레몬즙","매실","바나나","배","배즙","복숭아","사과","사과즙"]
  } else if (Val == '육류') {
    gus = ["고기","차돌박이","닭","닭가슴살","닭날개","닭다리","닭똥집","닭봉","닭안심","대패삼겹살","돈가스",
  "돼지갈비","돼지고기","돼지고기간것","돼지고기불고기용","돼지고기잡채용","돼지고기찌개용","돼지등뼈","돼지등심","돼지목살",
  "돼지안심","돼지앞다리살","베이컨","부채살","비엔나소시지","삼겹살","소갈비","소고기","소고기간것","소고기국거리","소고기다진것","소고기등심",
  "소고기불고기용","소고기샤브샤브용","소고기안심","소세지","슬라이스햄"]
  } else if (Val == '콩류') {
    gus = ["검은콩","견과류","두부","두유","땅콩","땅콩가루","땅콩버터","볶은땅콩"]
  } else if (Val == '곡류') {
    gus = ["박력쌀가루",]
  } else if (Val == '해조류') {
    gus = ["다시마","건다시마","다시마육수","김","김가루","김밥김","김자반","메생이","미역" ]
  } else if (Val == '어패류') {
    gus = ["가자미","갈치","고등어","고등어통조림","참치","참치캔","고추참치","꽁치","꽁치통조림","낙지","문어","동태","멸치",
    "명란","명란젓","모시조개","삼치","바지락"]
  } else if (Val == '갑각류') {
    gus = ["냉동새우","보리새우","건새우","새우","대하","오징어","갑오징어","물오징어","게살","관자","꼬막","꽃게",""]
  } else if (Val == '버섯류') {
    gus = ["팽이버섯","목이버섯","만가닥버섯","맛타리버섯","건표고버섯","표고버섯","백만송이버섯","버섯","새송이버섯"]
  } else if (Val == '채소류') {
    gus = ["깻잎", "숙주나물", "다진마늘", "다진생강", "청양고추", "콩나물","비름나물", "대파", "양파", "고수","가지"
  ,"감자","감자전분","건고추","고추","청양고추","고구마","고구마줄기","김치","냉이","꽈리고추","브로콜리",
"느타리버섯","단무지","단호박","달래","당근","대추","대파","더덕","도라지","도토리묵","돌나물","돌미나리","돼지호박",
"두릅","로메인","로즈마리","마늘","마늘종","무","무말랭이","무순","미나리","밤","방울양배추","방울토마토","방풍나물",
"배추","부추","상추","새싹채소","샐러드채소","샐러리","생강","생강즙","생강청","세발나물","숙주","시금치","시래기","신김치","실고추"]
  } else if (Val == '소스류') {
    gus = ["간장", "진간장", "국간장", "감식초", "마요네즈", "깨소금", "꿀", "녹말가루", "고춧가루", "들깨가루", "설탕", "소금", "된장", "쌈장", "고추장",
      "구운소금", "굵은고추가루", "굵은소금", "굴소스", "들기름", "참기름", "고기육수", "맛간장", "맛소금", "맛술", "매실액", "매운고추가루",
      "멸치가루", "멸치다시육수", "멸치액젓", "무염버터", "물엿", "바질", "볶은참깨", "새우젓", "사과식초", "시나몬파우더", "식용유", "액젓",
      "깨","올리고당", "올리브유", "짜장가루", "쯔유", "참치액젓", "초고추장", "케첩", "머스타드", "포도씨유", "핫소스", "허브솔트", "후추", "흑설탕",
      "고추냉이","녹차가루","누텔라","데리야끼소스","돈가스소스","두반장","말차가루","메밀가루","메이플시럽","미숫가루","미향","쇠고기다시다","시럽"]
  } else if (Val == '기타') {
    gus = ["가래떡","가쓰오부시","강력쌀가루","게맛살","계피","곤약","골뱅이","꽃빵","누룽지","모닝빵","명엽채",
  "당면","떡","떡국떡","또띠야","라면","라이스페이퍼","레드와인","마카다미아","마카로니","만두","밀가루","밀가루강력분","밀가루박력분","밀가루중력분","밀떡",
"바게트","부침가루","북어채","사이다","생크림","소면","소주","순대","순두부","술","스위트칠리소스","스테이크소스","스파게티면","식빵"]

    for (let i = 0; i < gus.length; i++) {
      temp_html += '<option value=' + gus[i] + '>' + gus[i] + '</option>'
    }


    $('#inputState_select2').empty()
    $('#inputState_select2').append(temp_html)

  }